tap "aws/tap"
tap "hashicorp/tap"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "joemiller/taps"
tap "jtyr/repo"
tap "reactiveops/tap"
tap "sammy007/cryptonight"
tap "skeema/tap"
tap "stylemistake/formulae"
brew "python@3.10"
brew "ansible"
brew "asciinema"
brew "coreutils"
brew "asdf"
brew "python@3.9"
brew "awscli"
brew "bash-completion@2"
brew "buildkit"
brew "libssh2"
brew "openldap"
brew "curl"
brew "gawk"
brew "gh"
brew "git"
brew "git-lfs"
brew "gitlab-runner"
brew "unbound"
brew "gnutls"
brew "gnupg"
brew "go"
brew "go-bindata"
brew "grep"
brew "hub"
brew "jq"
brew "k3d"
brew "k9s"
brew "krew"
brew "libpq"
brew "mysql-client", link: true
brew "node"
brew "nomad"
brew "parallel"
brew "postgresql"
brew "pstree"
brew "tcl-tk"
brew "python@3.8"
brew "redis"
brew "shellcheck"
brew "siege"
brew "sops"
brew "sshuttle"
brew "stern"
brew "thefuck"
brew "tmux"
brew "tree"
brew "vault"
brew "watch"
brew "wget"
brew "wireguard-tools"
brew "aws/tap/ec2-instance-selector"
brew "hashicorp/tap/consul"
brew "joemiller/taps/vault-token-helper"
brew "jtyr/repo/gbt-git", args: ["HEAD"]
cask "font-hack-nerd-font"
cask "google-cloud-sdk"
