tap "homebrew/cask-fonts"
tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "jtyr/repo"
tap "reactiveops/tap"
tap "rlister/let-me-in"
tap "sammy007/cryptonight"
tap "stylemistake/formulae"
tap "tdsmith/ham"
brew "asciinema"
brew "coreutils"
brew "asdf"
brew "azure-cli"
brew "bash-completion@2"
brew "circleci"
brew "curl", link: true
brew "exiftool"
brew "gawk"
brew "git"
brew "git-lfs"
brew "python"
brew "gnupg"
brew "go"
brew "imagemagick"
brew "jq"
brew "libpq"
brew "node"
brew "openvpn"
brew "parallel"
brew "pgcli"
brew "pre-commit"
brew "pstree"
brew "shellcheck"
brew "shyaml"
brew "siege"
brew "sops"
brew "stern"
brew "thefuck"
brew "tmux"
brew "tree"
brew "vault"
brew "watch"
brew "wget"
brew "heroku/brew/heroku"
brew "jtyr/repo/gbt-git", args: ["HEAD"]
brew "rlister/let-me-in/let-me-in"
brew "stylemistake/formulae/runner"
cask "1password-cli"
cask "font-hack-nerd-font"
